
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/personal_demos/ecs-development/runs/run-5a1tnrHhU97MXwTv

Waiting for the plan to start...

Terraform v1.3.3
on linux_amd64
Initializing plugins and modules...
module.atlas-cluster.mongodbatlas_project_ip_access_list.test: Refreshing state... [id=ZW50cnk=:MTAuMC4wLjAvMTY=-cHJvamVjdF9pZA==:NjM1MzhiYjU1NzM1ZTkwNTJiZTc4OGFk]
module.atlas-cluster.mongodbatlas_database_user.dbuser: Refreshing state... [id=YXV0aF9kYXRhYmFzZV9uYW1l:YWRtaW4=-cHJvamVjdF9pZA==:NjM1MzhiYjU1NzM1ZTkwNTJiZTc4OGFk-dXNlcm5hbWU=:YWRtaW5fdA==]
module.atlas-cluster.mongodbatlas_cluster.db-cluster: Refreshing state... [id=Y2x1c3Rlcl9pZA==:NjM2M2ViOTRhNzBkMzA2YTY4MDM3OWRl-Y2x1c3Rlcl9uYW1l:ZGV2ZWxvcG1lbnQtZGI=-cHJvamVjdF9pZA==:NjM1MzhiYjU1NzM1ZTkwNTJiZTc4OGFk-cHJvdmlkZXJfbmFtZQ==:VEVOQU5U]
aws_vpc.main: Refreshing state... [id=vpc-003f67c71428c4071]
aws_internet_gateway.main: Refreshing state... [id=igw-0af1f0cf63d6e7ca3]
aws_security_group.ecs_tasks_sg: Refreshing state... [id=sg-0aab33c4bfeda9880]
module.public_subnet_1.aws_subnet.ecs_subnet: Refreshing state... [id=subnet-03f14f9cd43e33fee]
module.route_table_public_1.aws_route_table.table: Refreshing state... [id=rtb-0bd74655e2e7adef7]
module.route_table_public_2.aws_route_table.table: Refreshing state... [id=rtb-03658c062cea741b5]
module.private_subnet_1.aws_subnet.ecs_subnet: Refreshing state... [id=subnet-0553f4cc8aea721ea]
module.private_subnet_2.aws_subnet.ecs_subnet: Refreshing state... [id=subnet-02d2e775b5579e54d]
module.public_subnet_2.aws_subnet.ecs_subnet: Refreshing state... [id=subnet-068c4ece1ddf605f2]
aws_security_group.alb-sg: Refreshing state... [id=sg-0343f2dadab70af0a]
module.nat_av_2.aws_eip.nat: Refreshing state... [id=eipalloc-07ad5706c84a38ccf]
module.nat_av_1.aws_eip.nat: Refreshing state... [id=eipalloc-0e6c5943db77ac164]
module.route_table_public_1.aws_route.route: Refreshing state... [id=r-rtb-0bd74655e2e7adef71080289494]
module.route_table_public_2.aws_route.route: Refreshing state... [id=r-rtb-03658c062cea741b51080289494]
module.route_table_public_1.aws_route_table_association.route_association: Refreshing state... [id=rtbassoc-07a4f6edf497dfdec]
module.route_table_public_2.aws_route_table_association.route_association: Refreshing state... [id=rtbassoc-0281cfbbdcef61e87]
module.load_balancer.aws_lb.main_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:153042419275:loadbalancer/app/esc-app-alb-development/8d7a0d280d07970f]
module.nat_av_2.aws_nat_gateway.main: Refreshing state... [id=nat-038cf3482cbaf858e]
module.route_table_private_2.aws_route_table.table: Refreshing state... [id=rtb-0b2a788f5da5b1806]
module.nat_av_1.aws_nat_gateway.main: Refreshing state... [id=nat-0fe66a34edb0e7d44]
module.route_table_private_2.aws_route_table_association.route_association: Refreshing state... [id=rtbassoc-075ad9fba49b1f976]
module.route_table_private_2.aws_route.route: Refreshing state... [id=r-rtb-0b2a788f5da5b18061080289494]
module.route_table_private_1.aws_route_table.table: Refreshing state... [id=rtb-096d405923fa978df]
module.load_balancer.aws_alb_target_group.main_gr: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:153042419275:targetgroup/esc-app-tg-lb-development/188fa387d9e45083]
cloudflare_record.record: Refreshing state... [id=c570d8676055c91440cdaf112c5b55cf]
module.load_balancer.aws_alb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:153042419275:listener/app/esc-app-alb-development/8d7a0d280d07970f/6be95be5103a8026]
module.route_table_private_1.aws_route_table_association.route_association: Refreshing state... [id=rtbassoc-081b39328751530e4]
module.route_table_private_1.aws_route.route: Refreshing state... [id=r-rtb-096d405923fa978df1080289494]
module.load_balancer.aws_alb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:153042419275:listener/app/esc-app-alb-development/8d7a0d280d07970f/0effbfccf0fbdeda]
module.esc_cluster.aws_cloudwatch_log_group.main_lgr: Refreshing state... [id=esc-app-lgr-development]
module.esc_cluster.aws_ecs_cluster.main_ecs_cluster: Refreshing state... [id=arn:aws:ecs:us-east-2:153042419275:cluster/esc-app-cluster-development]
module.esc_cluster.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=esc-app-cluster-rol-development]
module.esc_cluster.aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=esc-app-cluster-rol-development-20221103162821426300000001]
module.esc_cluster.aws_ecs_task_definition.main: Refreshing state... [id=esc-app-task-development]
module.esc_cluster.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:us-east-2:153042419275:service/esc-app-cluster-development/esc-app-service-development]
module.autoscaling.aws_appautoscaling_target.main_ecs_target_scaling: Refreshing state... [id=service/esc-app-cluster-development/esc-app-service-development]
module.autoscaling.aws_appautoscaling_policy.ecs_policy_memory: Refreshing state... [id=esc-app-memory-policy-development]
module.autoscaling.aws_appautoscaling_policy.ecs_policy_cpu: Refreshing state... [id=esc-app-cpu-policy-development]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.esc_cluster.aws_ecs_service.main has changed
  ~ resource "aws_ecs_service" "main" {
      ~ desired_count                      = 2 -> 1
        id                                 = "arn:aws:ecs:us-east-2:153042419275:service/esc-app-cluster-development/esc-app-service-development"
        name                               = "esc-app-service-development"
      + tags                               = {}
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.esc_cluster.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-2:153042419275:task-definition/esc-app-task-development:27" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0 -> null
                  - mountPoints      = [] -> null
                    name             = "esc-app-container-development"
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                },
            ]
        )
      ~ cpu                      = "512" -> "0.5 vCPU" # forces replacement
      ~ id                       = "esc-app-task-development" -> (known after apply)
      ~ memory                   = "1024" -> "1GB" # forces replacement
      ~ revision                 = 27 -> (known after apply)
        tags                     = {
            "Environment" = "development"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.


```
</details>
*Pusher: @SalvadorM271, Action: `pull_request`*